In [1]:
%load_ext sql
%env DATABASE_URL = postgresql://marcio_gabriel:123456@localhost:5432/data_engineering

env: DATABASE_URL=postgresql://marcio_gabriel:123456@localhost:5432/data_engineering

# STRING MANIPULATION

In [2]:
%%sql
SELECT lower('HeLLo WoRld') AS lower_result, 
upper('HeLLo WoRld') AS upper_result, 
initcap('HeLLo WoRld') AS initcap_result

1 rows affected.

[('hello world', 'HELLO WORLD', 'Hello World')]

In [3]:
%%sql
SELECT length('HeLLo WoRld') AS length

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(11,)]

In [4]:
%%sql
SELECT order_id, order_date, order_customer_id,
    lower(order_status) AS order_status,
    length(order_status) AS order_status_length
FROM orders
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'closed', 6),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'pending_payment', 15),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'complete', 8),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'closed', 6),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'complete', 8),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'complete', 8),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'complete', 8),
 (8, datetime.datetime(2013, 7, 25, 0, 0), 2911, 'processing', 10),
 (9, datetime.datetime(2013, 7, 25, 0, 0), 5657, 'pending_payment', 15),
 (10, datetime.datetime(2013, 7, 25, 0, 0), 5648, 'pending_payment', 15)]

In [5]:
%%sql
SELECT order_id, 
    SUBSTR(order_date::varchar,1,7) AS order_date,
    order_customer_id,
    order_status
FROM orders
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(1, '2013-07', 11599, 'CLOSED'),
 (2, '2013-07', 256, 'PENDING_PAYMENT'),
 (3, '2013-07', 12111, 'COMPLETE'),
 (4, '2013-07', 8827, 'CLOSED'),
 (5, '2013-07', 11318, 'COMPLETE'),
 (6, '2013-07', 7130, 'COMPLETE'),
 (7, '2013-07', 4530, 'COMPLETE'),
 (8, '2013-07', 2911, 'PROCESSING'),
 (9, '2013-07', 5657, 'PENDING_PAYMENT'),
 (10, '2013-07', 5648, 'PENDING_PAYMENT')]

# Using Position and strpos

In [6]:
%%sql
SELECT position('@' IN 'it@versity.com'),
    position('@' IN 'itversity.com')

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(3, 0)]

In [7]:
%%sql
SELECT strpos('it@versity.com','@'),
    strpos('itversity.com', '@')

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(3, 0)]

In [8]:
%%sql

WITH email_ids AS (
    SELECT 'bsellan0@yellowbook.com' AS email_id UNION
    SELECT 'rstelljes1@illinois.edu' UNION
    SELECT 'mmalarkey2@webeden.co.uk' UNION
    SELECT 'emussared3@redcross.org' UNION
    SELECT 'livashin4@bloglovin.com' UNION
    SELECT 'gkeach5cbc.ca' UNION
    SELECT 'emasham6@xing.com' UNION
    SELECT 'rcobbald7@house.gov' UNION
    SELECT 'rdrohan8@washingtonpost.com' UNION
    SELECT 'aebben9@arstechnica.com'
) SELECT email_id, position('@' IN email_id),
    strpos(email_id, '@')
FROM email_ids
ORDER BY 2, 1

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[('gkeach5cbc.ca', 0, 0),
 ('aebben9@arstechnica.com', 8, 8),
 ('bsellan0@yellowbook.com', 9, 9),
 ('emasham6@xing.com', 9, 9),
 ('rdrohan8@washingtonpost.com', 9, 9),
 ('livashin4@bloglovin.com', 10, 10),
 ('rcobbald7@house.gov', 10, 10),
 ('emussared3@redcross.org', 11, 11),
 ('mmalarkey2@webeden.co.uk', 11, 11),
 ('rstelljes1@illinois.edu', 11, 11)]

In [9]:
%%sql

WITH email_ids AS (
    SELECT 'bsellan0@yellowbook.com' AS email_id UNION
    SELECT 'rstelljes1@illinois.edu' UNION
    SELECT 'mmalarkey2@webeden.co.uk' UNION
    SELECT 'emussared3@redcross.org' UNION
    SELECT 'livashin4@bloglovin.com' UNION
    SELECT 'gkeach5cbc.ca' UNION
    SELECT 'emasham6@xing.com' UNION
    SELECT 'rcobbald7@house.gov' UNION
    SELECT 'rdrohan8@washingtonpost.com' UNION
    SELECT 'aebben9@arstechnica.com'
) SELECT email_id, position('@' IN email_id),
    strpos(email_id, '@')
FROM email_ids
WHERE position ('@' IN email_id) = 0
ORDER BY 1

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('gkeach5cbc.ca', 0, 0)]

In [10]:
%%sql

WITH unique_ids AS (
    SELECT '241-80-7115' AS unique_id UNION
    SELECT '694-30-6851' UNION
    SELECT '586-92-5361' UNION
    SELECT '884-65-284' UNION
    SELECT '876-99-585' UNION
    SELECT '831-59-5593' UNION
    SELECT '399-88-3617' UNION
    SELECT '733-17-4217' UNION
    SELECT '873-68-9778' UNION
    SELECT '48'
) SELECT unique_id,
     position('-' IN unique_id) AS pos,
    position('-' IN unique_id) + position('-' IN substring(unique_id FROM 5)) AS pos_2nd
    
FROM unique_ids
ORDER BY unique_id

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[('241-80-7115', 4, 7),
 ('399-88-3617', 4, 7),
 ('48', 0, 0),
 ('586-92-5361', 4, 7),
 ('694-30-6851', 4, 7),
 ('733-17-4217', 4, 7),
 ('831-59-5593', 4, 7),
 ('873-68-9778', 4, 7),
 ('876-99-585', 4, 7),
 ('884-65-284', 4, 7)]

### Trimming and Padding Functions

In [11]:
%%sql

SELECT ltrim('     Hello World') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('Hello World',)]

In [12]:
%%sql

SELECT rtrim('     Hello World       ') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('     Hello World',)]

In [13]:
%%sql

SELECT length(trim('     Hello World       ')) AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(11,)]

In [14]:
%%sql

SELECT ltrim('----Hello World----', '-') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('Hello World----',)]

In [15]:
%%sql

SELECT rtrim('----Hello World----', '-') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('----Hello World',)]

In [16]:
%%sql

SELECT trim('----Hello World----', '-') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('Hello World',)]

In [17]:
%%sql

SELECT trim(TRAILING '-' FROM '----Hello World----') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('----Hello World',)]

In [18]:
%%sql

SELECT trim(BOTH '-' FROM '----Hello World----') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('Hello World',)]

In [19]:
%%sql

SELECT 2013 AS year, 7 AS month, 25 AS myDate

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(2013, 7, 25)]

In [20]:
%%sql

SELECT lpad(7::varchar, 2, '0') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('07',)]

In [21]:
%%sql

SELECT lpad(10::varchar, 2, '0') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('10',)]

In [22]:
%%sql

SELECT lpad(100::varchar, 2, '0') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('10',)]

### Reverse and Concatenating multiple strings

In [23]:
%%sql

SELECT reverse('Hello World') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('dlroW olleH',)]

In [24]:
%%sql

SELECT concat('Hello ', 'World') AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('Hello World',)]

In [25]:
%%sql

SELECT concat('Order Status is ', order_status) AS result
FROM orders LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[('Order Status is CLOSED',),
 ('Order Status is PENDING_PAYMENT',),
 ('Order Status is COMPLETE',),
 ('Order Status is CLOSED',),
 ('Order Status is COMPLETE',),
 ('Order Status is COMPLETE',),
 ('Order Status is COMPLETE',),
 ('Order Status is PROCESSING',),
 ('Order Status is PENDING_PAYMENT',),
 ('Order Status is PENDING_PAYMENT',)]

In [26]:
%%sql

SELECT * FROM (SELECT 2013 AS year, 7 AS month, 25 AS myDate) q

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(2013, 7, 25)]

In [27]:
%%sql

SELECT concat(year, '-', lpad(month::varchar, 2, '0'), '-',
              lpad(myDate::varchar, 2, '0')) AS order_date
FROM
    (SELECT 2013 AS year, 7 AS month, 25 AS myDate) q

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('2013-07-25',)]

In [28]:
%%sql

SELECT concat_ws(
    '-', 
    year, 
    lpad(month::varchar, 2, '0'),
    lpad(myDate::varchar, 2, '0')
) AS order_date
FROM
    (SELECT 2013 AS year, 7 AS month, 25 AS myDate)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
(psycopg2.errors.SyntaxError) subquery in FROM must have an alias
LINE 8:     (SELECT 2013 AS year, 7 AS month, 25 AS myDate)
            ^
HINT:  For example, FROM (SELECT ...) [AS] foo.

[SQL: SELECT concat_ws(
    '-',
    year,
    lpad(month::varchar, 2, '0'),
    lpad(myDate::varchar, 2, '0')
) AS order_date
FROM
    (SELECT 2013 AS year, 7 AS month, 25 AS myDate)]
(Background on this error at: https://sqlalche.me/e/14/f405)

## Date Manipulation Functions

In [29]:
%%sql

SELECT current_date AS current_date

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.date(2022, 12, 9),)]

In [30]:
%%sql

SELECT current_timestamp AS current_timestamp

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 9, 15, 33, 0, 118860, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))),)]

In [31]:
%%sql

SELECT substring(current_date::varchar, 1, 4) AS current_date

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('2022',)]

In [32]:
%%sql

SELECT current_date + INTERVAL '32 DAYS' AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2023, 1, 10, 0, 0),)]

In [33]:
%%sql

SELECT current_date + INTERVAL '730 DAYS' AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2024, 12, 8, 0, 0),)]

In [34]:
%%sql

SELECT current_date + INTERVAL '-730 DAYS' AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2020, 12, 9, 0, 0),)]

In [35]:
%%sql

SELECT current_date + INTERVAL '3 MONTHS' AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2023, 3, 9, 0, 0),)]

In [36]:
%%sql

SELECT '2019-01-31'::date + INTERVAL '3 MONTHS' AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2019, 4, 30, 0, 0),)]

In [37]:
%%sql

SELECT '2019-01-31'::date + INTERVAL '3 MONTHS 3 DAYS 3 HOURS' AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2019, 5, 3, 3, 0),)]

In [38]:
%%sql

SELECT current_timestamp + INTERVAL '3 MONTHS' AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2023, 3, 9, 15, 33, 0, 604745, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))),)]

In [39]:
%%sql

SELECT current_timestamp + INTERVAL '10 HOURS' AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 10, 1, 33, 0, 684863, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))),)]

In [40]:
%%sql

SELECT current_timestamp + INTERVAL '10 MINUTES' AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 9, 15, 43, 0, 745822, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))),)]

In [41]:
%%sql

SELECT current_timestamp + INTERVAL '10 HOURS 10 MINUTES' AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 10, 1, 43, 0, 806325, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))),)]

In [42]:
%%sql

SELECT '2019-03-30'::date - '2017-12-31'::date AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(454,)]

In [43]:
%%sql

SELECT date_trunc('YEAR', current_date) AS year_beginning

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))),)]

In [44]:
%%sql

SELECT date_trunc('MONTH', current_date) AS month_beginning

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))),)]

In [45]:
%%sql

SELECT date_trunc('WEEK', current_date) AS week_beginning

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 5, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))),)]

In [46]:
%%sql

SELECT date_trunc('DAY', current_date) AS day_beginning

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 9, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))),)]

In [47]:
%%sql

SELECT date_trunc('HOUR', current_timestamp) AS hour_beginning

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 9, 15, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))),)]

In [48]:
%%sql
SELECT * FROM orders
WHERE order_date BETWEEN date_trunc('MONTH', '2014-01-10'::date) AND '2014-01-10'::date
ORDER BY order_date
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(25877, datetime.datetime(2014, 1, 1, 0, 0), 5549, 'PENDING_PAYMENT'),
 (25878, datetime.datetime(2014, 1, 1, 0, 0), 9084, 'PENDING'),
 (25879, datetime.datetime(2014, 1, 1, 0, 0), 5118, 'PENDING'),
 (25880, datetime.datetime(2014, 1, 1, 0, 0), 10146, 'CANCELED'),
 (25881, datetime.datetime(2014, 1, 1, 0, 0), 3205, 'PENDING_PAYMENT'),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 4598, 'COMPLETE'),
 (25883, datetime.datetime(2014, 1, 1, 0, 0), 11764, 'PENDING'),
 (25884, datetime.datetime(2014, 1, 1, 0, 0), 7904, 'PENDING_PAYMENT'),
 (25885, datetime.datetime(2014, 1, 1, 0, 0), 7253, 'PENDING'),
 (25876, datetime.datetime(2014, 1, 1, 0, 0), 3414, 'PENDING_PAYMENT')]

In [49]:
%%sql

SELECT current_timestamp AS current_timestamp, 
    to_char(current_timestamp, 'yyyy') AS year

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 9, 15, 33, 6, 430107, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))), '2022')]

In [50]:
%%sql

SELECT current_timestamp AS current_timestamp, 
    to_char(current_timestamp, 'yyyy') AS year,
    to_date('2020', 'yyyy')

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 9, 15, 33, 51, 61186, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))), '2022', datetime.date(2020, 1, 1))]

In [51]:
%%sql

SELECT current_timestamp AS current_timestamp, 
    to_char(current_timestamp, 'Mon') AS month_name

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 9, 15, 38, 16, 859179, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))), 'Dec')]

In [52]:
%%sql

SELECT current_timestamp AS current_timestamp, 
    to_char(current_timestamp, 'DY') AS day_name

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 9, 15, 38, 23, 781808, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))), 'FRI')]

In [53]:
%%sql

SELECT current_timestamp AS current_timestamp, 
    to_char(current_timestamp, 'day') AS day_name

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 9, 15, 38, 29, 315311, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))), 'friday   ')]

In [54]:
%%sql

SELECT current_timestamp AS current_timestamp, 
    to_char('2020-11-17'::date, 'Day') AS dayname,
    length(to_char('2020-11-17'::date, 'Day')) AS dayname_length,
    length(trim(to_char('2020-11-17'::date, 'Day'))) AS dayname_trimmed_length

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 9, 15, 38, 37, 699000, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))), 'Tuesday  ', 9, 7)]

In [55]:
%%sql

SELECT current_timestamp AS current_timestamp, 
    to_char(current_timestamp, 'HH') AS hour24

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(datetime.datetime(2022, 12, 9, 15, 41, 13, 279681, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=75600))), '03')]

In [56]:
%%sql

SELECT extract(century FROM current_date) AS century

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(Decimal('21'),)]

In [57]:
%%sql

SELECT extract(decade FROM current_date) AS decade

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(Decimal('202'),)]

In [58]:
%%sql

SELECT extract(year FROM current_date) AS year

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(Decimal('2022'),)]

In [59]:
%%sql

SELECT extract(quarter FROM current_date) AS quarter

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(Decimal('4'),)]

In [60]:
%%sql

SELECT extract(month FROM current_date) AS month

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(Decimal('12'),)]

In [61]:
%%sql

SELECT extract(month FROM current_date) AS month

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(Decimal('12'),)]

In [62]:
%%sql

SELECT extract(doy FROM current_date) AS day_of_year

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(Decimal('343'),)]

In [63]:
%%sql

SELECT extract(dow FROM current_date) AS day_of_week

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(Decimal('5'),)]

## Overview of Numeric Functions

In [64]:
%%sql

SELECT avg(order_item_subtotal) AS order_revenue_avg FROM order_items
WHERE order_item_order_id = 2

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(193.32666666666668,)]

In [65]:
%%sql

SELECT order_item_order_id, 
    sum(order_item_subtotal) AS order_revenue_sum
FROM order_items
GROUP BY order_item_order_id
ORDER BY order_item_order_id
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(1, 299.98),
 (2, 579.98),
 (4, 699.85),
 (5, 1129.8600000000001),
 (7, 579.9200000000001),
 (8, 729.8399999999999),
 (9, 599.96),
 (10, 651.9200000000001),
 (11, 919.79),
 (12, 1299.8700000000001)]

In [66]:
%%sql

SELECT
    round(10.58) rnd,
    floor(10.58) flr,
    ceil(10.58) cl

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(Decimal('11'), Decimal('10'), Decimal('11'))]

In [67]:
%%sql

SELECT
    round(10.48, 1) rnd,
    floor(10.48) flr,
    ceil(10.48) cl

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(Decimal('10.5'), Decimal('10'), Decimal('11'))]

In [68]:
%%sql

SELECT order_item_order_id, 
    round(sum(order_item_subtotal)::numeric, 2) AS order_revenue_avg 
FROM order_items
GROUP BY order_item_order_id
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(1, Decimal('299.98')),
 (2, Decimal('579.98')),
 (4, Decimal('699.85')),
 (5, Decimal('1129.86')),
 (7, Decimal('579.92')),
 (8, Decimal('729.84')),
 (9, Decimal('599.96')),
 (10, Decimal('651.92')),
 (11, Decimal('919.79')),
 (12, Decimal('1299.87'))]

In [69]:
%%sql

SELECT greatest(10, 11, 10.5)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(Decimal('11'),)]

In [70]:
%%sql

SELECT order_item_order_id, 
    round(sum(order_item_subtotal)::numeric, 2) AS order_revenue_sum,
    min(order_item_subtotal) AS order_item_subtotal_min,
    max(order_item_subtotal) AS order_item_subtotal_max 
FROM order_items
GROUP BY order_item_order_id
LIMIT 10

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
10 rows affected.

[(1, Decimal('299.98'), 299.98, 299.98),
 (2, Decimal('579.98'), 129.99, 250.0),
 (4, Decimal('699.85'), 49.98, 299.95),
 (5, Decimal('1129.86'), 99.96, 299.98),
 (7, Decimal('579.92'), 79.95, 299.98),
 (8, Decimal('729.84'), 50.0, 299.95),
 (9, Decimal('599.96'), 199.98, 199.99),
 (10, Decimal('651.92'), 21.99, 199.99),
 (11, Decimal('919.79'), 49.98, 399.96),
 (12, Decimal('1299.87'), 100.0, 499.95)]

In [71]:
%sql SELECT (random() * 100)::int + 1

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(59,)]

## Data Type Conversion

In [73]:
%%sql

SELECT split_part('2020-09-30', '-', 2) AS month

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('09',)]

In [74]:
%%sql

SELECT to_char('2020-09-30'::date, 'MM') AS month

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[('09',)]

In [75]:
%%sql

SELECT cast('0.04000' AS FLOAT) AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(0.04,)]

## Handling NULL Values

In [76]:
%%sql

SELECT coalesce(1, 0) AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(1,)]

In [77]:
%%sql

SELECT coalesce(NULL, NULL, 2, NULL, 3) AS result

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(2,)]

In [78]:
%sql DROP TABLE IF EXISTS sales

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [79]:
%%sql

CREATE TABLE IF NOT EXISTS sales(
    sales_person_id INT,
    sales_amount FLOAT,
    commission_pct INT
)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
Done.

[]

In [80]:
%%sql

INSERT INTO sales VALUES
    (1, 1000, 10),
    (2, 1500, 8),
    (3, 500, NULL),
    (4, 800, 5),
    (5, 250, NULL)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
5 rows affected.

[]

In [81]:
%%sql

SELECT * FROM sales

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
5 rows affected.

[(1, 1000.0, 10),
 (2, 1500.0, 8),
 (3, 500.0, None),
 (4, 800.0, 5),
 (5, 250.0, None)]

In [82]:
%%sql

SELECT s.*, 
    round((sales_amount * commission_pct / 100)::numeric, 2) AS incorrect_commission_amount
FROM sales AS s

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
5 rows affected.

[(1, 1000.0, 10, Decimal('100.00')),
 (2, 1500.0, 8, Decimal('120.00')),
 (3, 500.0, None, None),
 (4, 800.0, 5, Decimal('40.00')),
 (5, 250.0, None, None)]

In [83]:
%%sql

SELECT s.*, 
    coalesce(commission_pct, 0) AS commission_pct
FROM sales AS s

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
5 rows affected.

[(1, 1000.0, 10, 10),
 (2, 1500.0, 8, 8),
 (3, 500.0, None, 0),
 (4, 800.0, 5, 5),
 (5, 250.0, None, 0)]

In [84]:
%%sql

SELECT s.*, 
    round((sales_amount * coalesce(commission_pct, 0) / 100)::numeric, 2) AS commission_amount
FROM sales AS s

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
5 rows affected.

[(1, 1000.0, 10, Decimal('100.00')),
 (2, 1500.0, 8, Decimal('120.00')),
 (3, 500.0, None, Decimal('0.00')),
 (4, 800.0, 5, Decimal('40.00')),
 (5, 250.0, None, Decimal('0.00'))]

In [85]:
%%sql

SELECT nullif(1, 0)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(1,)]

In [86]:
%%sql

SELECT nullif(1, 1)

 * postgresql://marcio_gabriel:***@localhost:5432/data_engineering
1 rows affected.

[(None,)]